self/case3/40000_piso/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (0 -0.05 0)
    (1.25 -0.05 0)
    (1.25 0.05 0)
    (0 0.05 0)
    (0 -0.05 .01)
    (1.25 -0.05 .01)
    (1.25 0.05 .01)
    (0 0.05 .01)  
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (60 100 1) simpleGrading (1 1 1)
);

edges
(
  arc 0 1 (.625 -0.125 0)
  arc 3 2 (.625 0.125 0)
  arc 7 6 (.625 0.125 .01)
  arc 4 5 (.625 -0.125 .01)
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
	    (0 4 7 3)
        );
    }
    outlet
    {
        type patch;
        faces
        (
	    (2 6 5 1)
        );
    }
    fixedWalls
    {
        type wall;
        faces
        (
            (3 7 6 2)
            (1 5 4 0)
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (0 3 2 1)
            (4 5 6 7)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
