self/case3/40000_piso/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    inlet
    {
        type            patch;
        nFaces          100;
        startFace       11840;
    }
    outlet
    {
        type            patch;
        nFaces          100;
        startFace       11940;
    }
    fixedWalls
    {
        type            wall;
        inGroups        1(wall);
        nFaces          120;
        startFace       12040;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          12000;
        startFace       12160;
    }
)

// ************************************************************************* //
